In [1]:
import pandas as pd
import numpy as np

train = pd.read_csv(r'/home/tony/Desktop/github_repos/Dataquest-modules/titanic/train.csv')
test = pd.read_csv(r'/home/tony/Desktop/github_repos/Dataquest-modules/titanic/test.csv')

In [2]:
df = pd.concat([train,test])

/home/tony/Desktop/github_repos/Dataquest-modules/venv/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [3]:
df

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450
...,...,...,...,...,...,...,...,...,...,...,...,...
413,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,1305,3,male,0,NaN,A.5. 3236
414,39.0,C105,C,108.9000,"Oliva y Ocana, Dona. Fermina",0,1306,1,female,0,NaN,PC 17758
415,38.5,NaN,S,7.2500,"Saether, Mr. Simon Sivertsen",0,1307,3,male,0,NaN,SOTON/O.Q. 3101262
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,1308,3,male,0,NaN,359309
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,NaN,2668

In [4]:
df.Sex.replace({'male':1,'female':0},inplace=True)

In [5]:
df.Age.fillna(df.Age.dropna().mean().astype('int64'),inplace=True)

In [6]:
df.Age.mean().astype('int64')

29

In [7]:

df.Age.describe()

count    1309.000000
mean       29.704102
std        12.888034
min         0.170000
25%        22.000000
50%        29.000000
75%        35.000000
max        80.000000
Name: Age, dtype: float64

In [8]:
df.Age = [0 if i <=22 else 1 if i >22 and i< 35 else 2 for i in df.Age]

In [9]:
df.Cabin.fillna('E',inplace=True)

In [10]:
df.Cabin = df.Cabin.str.replace('[^a-zA-Z]', '')

In [11]:
df.Cabin.value_counts()

E       1054
C         80
B         48
D         44
A         22
F         14
BB         8
CC         8
CCC        6
G          5
BBBB       5
FG         4
BBB        4
FE         3
DD         2
T          1
EE         1
Name: Cabin, dtype: int64

In [12]:
df.Cabin = ['E' if 'E' in i else 'D' if 'D' in i else 'C' if 'C' in i else 'B' if 'B' in i else 'G' if 'G' in i else i for i in df.Cabin]

In [13]:
df.Cabin.value_counts()

E    1058
C      94
B      65
D      46
A      22
F      14
G       9
T       1
Name: Cabin, dtype: int64

In [14]:
df.Cabin = [0 if i == 'A' or i == 'B' or i == 'C' else 1 if i == 'D' or i == 'E' or i =='F' else 2 for i in df.Cabin]

In [15]:
df.Cabin.value_counts()

1    1118
0     181
2      10
Name: Cabin, dtype: int64

In [16]:
df.Fare.describe()

count    1308.000000
mean       33.295479
std        51.758668
min         0.000000
25%         7.895800
50%        14.454200
75%        31.275000
max       512.329200
Name: Fare, dtype: float64

In [17]:
df.Fare = [2 if i < 8 else 1 if i > 8 and i< 32 else 0 for i in df.Fare]

In [18]:
df.Fare.value_counts()

1    637
2    360
0    312
Name: Fare, dtype: int64

In [19]:
df

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,0,1,S,2,"Braund, Mr. Owen Harris",0,1,3,1,1,0.0,A/5 21171
1,2,0,C,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,0,1,1.0,PC 17599
2,1,1,S,2,"Heikkinen, Miss. Laina",0,3,3,0,0,1.0,STON/O2. 3101282
3,2,0,S,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,0,1,1.0,113803
4,2,1,S,1,"Allen, Mr. William Henry",0,5,3,1,0,0.0,373450
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1,1,S,1,"Spector, Mr. Woolf",0,1305,3,1,0,NaN,A.5. 3236
414,2,0,C,0,"Oliva y Ocana, Dona. Fermina",0,1306,1,0,0,NaN,PC 17758
415,2,1,S,2,"Saether, Mr. Simon Sivertsen",0,1307,3,1,0,NaN,SOTON/O.Q. 3101262
416,1,1,S,1,"Ware, Mr. Frederick",0,1308,3,1,0,NaN,359309
417,1,1,C,1,"Peter, Master. Michael J",1,1309,3,1,1,NaN,2668

In [20]:
from sklearn.model_selection import train_test_split,GridSearchCV
from xgboost.sklearn import XGBClassifier
from sklearn.metrics import accuracy_score
import xgboost as xgb

X = df.drop(columns=['Survived','Embarked','Name','PassengerId','Ticket'])
y = df.Survived.fillna(1).astype('int64')

In [21]:
X.isnull().values.any()

False

In [22]:
y.isnull().values.any()

False

In [23]:
param_grid = {
    'n_estimators': [400, 700, 1000],
    'colsample_bytree': [0.7, 0.8],
    'max_depth': [15,20,25],
    'reg_alpha': [1.1, 1.2, 1.3],
    'reg_lambda': [1.1, 1.2, 1.3],
    'subsample': [0.7, 0.8, 0.9]
}

In [24]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.319,random_state=0)

In [25]:
classifier = XGBClassifier(objective='binary:logistic',n_jobs=-1)

In [26]:
grid = GridSearchCV(classifier,param_grid,n_jobs=-1)

In [27]:
grid.fit(X_train,y_train)

GridSearchCV(cv=None, error_score=nan,
             estimator=XGBClassifier(base_score=0.5, booster='gbtree',
                                     colsample_bylevel=1, colsample_bynode=1,
                                     colsample_bytree=1, gamma=0,
                                     learning_rate=0.1, max_delta_step=0,
                                     max_depth=3, min_child_weight=1,
                                     missing=None, n_estimators=100, n_jobs=-1,
                                     nthread=None, objective='binary:logistic',
                                     random_state=0, reg_alpha=0, reg_lambda=1,
                                     scale_pos_weight=1, seed=None, silent=None,
                                     subsample=1, verbosity=1),
             iid='deprecated', n_jobs=-1,
             param_grid={'colsample_bytree': [0.7, 0.8],
                         'max_depth': [15, 20, 25],
                         'n_estimators': [400, 700, 1000],
                         'reg_alpha': [1.1, 1.2, 1.3],
                         'reg_lambda': [1.1, 1.2, 1.3],
                         'subsample': [0.7, 0.8, 0.9]},
             pre_dispatch='2*n_jobs', refit=True, return_train_score=False,
             scoring=None, verbose=0)

In [28]:
predictions = grid.predict(X_test)

In [29]:
print(accuracy_score(y_test,predictions))

0.684964200477327

In [30]:
predictions = pd.DataFrame(predictions)

In [31]:
predictions.shape

(419, 1)

In [44]:
df.PassengerId.isna().shape

(1309,)